Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_1_4_base_modem/firmware/src/packs/PIC32CX2051MTG128_DFP/component/pio.h
/* -------- PIO_P_WPSR : (PIO Offset: 0x15E4) ( R/ 32) PIO Privilege Write Protection Status Register -------- */
#define PIO_P_WPSR_WPVS_Pos                   _UINT32_(0)                                          /* (PIO_P_WPSR) Write Protection Violation Status Position */
#define PIO_P_WPSR_WPVS_Msk                   (_UINT32_(0x1) << PIO_P_WPSR_WPVS_Pos)               /* (PIO_P_WPSR) Write Protection Violation Status Mask */
#define PIO_P_WPSR_WPVS(value)                (PIO_P_WPSR_WPVS_Msk & (_UINT32_(value) << PIO_P_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the PIO_P_WPSR register */
#define PIO_P_WPSR_WPVSRC_Pos                 _UINT32_(8)                                          /* (PIO_P_WPSR) Write Protection Violation Source Position */
#define PIO_P_WPSR_WPVSRC_Msk                 (_UINT32_(0xFFFF) << PIO_P_WPSR_WPVSRC_Pos)          /* (PIO_P_WPSR) Write Protection Violation Source Mask */
#define PIO_P_WPSR_WPVSRC(value)              (PIO_P_WPSR_WPVSRC_Msk & (_UINT32_(value) << PIO_P_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the PIO_P_WPSR register */
#define PIO_P_WPSR_Msk                        _UINT32_(0x00FFFF01)                                 /* (PIO_P_WPSR) Register Mask  */


/** \brief PIO register offsets definitions */
#define PIO_MSKR_REG_OFST              _UINT32_(0x00)      /* (PIO_MSKR) PIO Mask Register Offset */
#define PIO_CFGR_REG_OFST              _UINT32_(0x04)      /* (PIO_CFGR) PIO Configuration Register Offset */
#define PIO_PDSR_REG_OFST              _UINT32_(0x08)      /* (PIO_PDSR) PIO Pin Data Status Register Offset */
#define PIO_LOCKSR_REG_OFST            _UINT32_(0x0C)      /* (PIO_LOCKSR) PIO Lock Status Register Offset */
#define PIO_SODR_REG_OFST              _UINT32_(0x10)      /* (PIO_SODR) PIO Set Output Data Register Offset */
#define PIO_CODR_REG_OFST              _UINT32_(0x14)      /* (PIO_CODR) PIO Clear Output Data Register Offset */
#define PIO_ODSR_REG_OFST              _UINT32_(0x18)      /* (PIO_ODSR) PIO Output Data Status Register Offset */
#define PIO_IER_REG_OFST               _UINT32_(0x20)      /* (PIO_IER) PIO Interrupt Enable Register Offset */
#define PIO_IDR_REG_OFST               _UINT32_(0x24)      /* (PIO_IDR) PIO Interrupt Disable Register Offset */
#define PIO_IMR_REG_OFST               _UINT32_(0x28)      /* (PIO_IMR) PIO Interrupt Mask Register Offset */
#define PIO_ISR_REG_OFST               _UINT32_(0x2C)      /* (PIO_ISR) PIO Interrupt Status Register Offset */
#define PIO_IOFR_REG_OFST              _UINT32_(0x3C)      /* (PIO_IOFR) PIO I/O Freeze Configuration Register Offset */
#define PIO_P_MSKR_REG_OFST            _UINT32_(0x00)      /* (PIO_P_MSKR) PIO Privilege Mask Register (p_iogroup = 0) Offset */
#define PIO_P_CFGR_REG_OFST            _UINT32_(0x04)      /* (PIO_P_CFGR) PIO Privilege Configuration Register (p_iogroup = 0) Offset */
#define PIO_P_PDSR_REG_OFST            _UINT32_(0x08)      /* (PIO_P_PDSR) PIO Privilege Pin Data Status Register (p_iogroup = 0) Offset */
#define PIO_P_LOCKSR_REG_OFST          _UINT32_(0x0C)      /* (PIO_P_LOCKSR) PIO Privilege Lock Status Register (p_iogroup = 0) Offset */
#define PIO_P_SODR_REG_OFST            _UINT32_(0x10)      /* (PIO_P_SODR) PIO Privilege Set Output Data Register (p_iogroup = 0) Offset */
#define PIO_P_CODR_REG_OFST            _UINT32_(0x14)      /* (PIO_P_CODR) PIO Privilege Clear Output Data Register (p_iogroup = 0) Offset */
#define PIO_P_ODSR_REG_OFST            _UINT32_(0x18)      /* (PIO_P_ODSR) PIO Privilege Output Data Status Register (p_iogroup = 0) Offset */
#define PIO_P_IER_REG_OFST             _UINT32_(0x20)      /* (PIO_P_IER) PIO Privilege Interrupt Enable Register (p_iogroup = 0) Offset */
#define PIO_P_IDR_REG_OFST             _UINT32_(0x24)      /* (PIO_P_IDR) PIO Privilege Interrupt Disable Register (p_iogroup = 0) Offset */
#define PIO_P_IMR_REG_OFST             _UINT32_(0x28)      /* (PIO_P_IMR) PIO Privilege Interrupt Mask Register (p_iogroup = 0) Offset */
#define PIO_P_ISR_REG_OFST             _UINT32_(0x2C)      /* (PIO_P_ISR) PIO Privilege Interrupt Status Register (p_iogroup = 0) Offset */
#define PIO_P_SIO_UAR_REG_OFST         _UINT32_(0x30)      /* (PIO_P_SIO_UAR) PIO Privilege Set I/O User Register (p_iogroup = 0) Offset */
#define PIO_P_SIO_PAR_REG_OFST         _UINT32_(0x34)      /* (PIO_P_SIO_PAR) PIO Privilege Set I/O Privilege Register (p_iogroup = 0) Offset */
#define PIO_P_IOSSR_REG_OFST           _UINT32_(0x38)      /* (PIO_P_IOSSR) PIO Privilege I/O Security Status Register (p_iogroup = 0) Offset */
#define PIO_P_IOFR_REG_OFST            _UINT32_(0x3C)      /* (PIO_P_IOFR) PIO Privilege I/O Freeze Configuration Register (p_iogroup = 0) Offset */
#define PIO_WPMR_REG_OFST              _UINT32_(0x5E0)     /* (PIO_WPMR) PIO Write Protection Mode Register Offset */
#define PIO_WPSR_REG_OFST              _UINT32_(0x5E4)     /* (PIO_WPSR) PIO Write Protection Status Register Offset */
#define PIO_P_SCDR_REG_OFST            _UINT32_(0x1500)    /* (PIO_P_SCDR) PIO Privilege Slow Clock Divider Debouncing Register Offset */
#define PIO_P_WPMR_REG_OFST            _UINT32_(0x15E0)    /* (PIO_P_WPMR) PIO Privilege Write Protection Mode Register Offset */
#define PIO_P_WPSR_REG_OFST            _UINT32_(0x15E4)    /* (PIO_P_WPSR) PIO Privilege Write Protection Status Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PIO_GROUP register API structure */
typedef struct
{
  __IO  uint32_t                       PIO_MSKR;           /**< Offset: 0x00 (R/W  32) PIO Mask Register */
  __IO  uint32_t                       PIO_CFGR;           /**< Offset: 0x04 (R/W  32) PIO Configuration Register */
  __I   uint32_t                       PIO_PDSR;           /**< Offset: 0x08 (R/   32) PIO Pin Data Status Register */
  __I   uint32_t                       PIO_LOCKSR;         /**< Offset: 0x0C (R/   32) PIO Lock Status Register */
  __O   uint32_t                       PIO_SODR;           /**< Offset: 0x10 ( /W  32) PIO Set Output Data Register */
  __O   uint32_t                       PIO_CODR;           /**< Offset: 0x14 ( /W  32) PIO Clear Output Data Register */
  __IO  uint32_t                       PIO_ODSR;           /**< Offset: 0x18 (R/W  32) PIO Output Data Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       PIO_IER;            /**< Offset: 0x20 ( /W  32) PIO Interrupt Enable Register */
  __O   uint32_t                       PIO_IDR;            /**< Offset: 0x24 ( /W  32) PIO Interrupt Disable Register */
  __I   uint32_t                       PIO_IMR;            /**< Offset: 0x28 (R/   32) PIO Interrupt Mask Register */
  __I   uint32_t                       PIO_ISR;            /**< Offset: 0x2C (R/   32) PIO Interrupt Status Register */
  __I   uint8_t                        Reserved2[0x0C];
  __O   uint32_t                       PIO_IOFR;           /**< Offset: 0x3C ( /W  32) PIO I/O Freeze Configuration Register */
} pio_group_registers_t;

/** \brief PIO_P register API structure */
typedef struct
{
  __IO  uint32_t                       PIO_P_MSKR;         /**< Offset: 0x00 (R/W  32) PIO Privilege Mask Register (p_iogroup = 0) */
  __IO  uint32_t                       PIO_P_CFGR;         /**< Offset: 0x04 (R/W  32) PIO Privilege Configuration Register (p_iogroup = 0) */
  __I   uint32_t                       PIO_P_PDSR;         /**< Offset: 0x08 (R/   32) PIO Privilege Pin Data Status Register (p_iogroup = 0) */
  __I   uint32_t                       PIO_P_LOCKSR;       /**< Offset: 0x0C (R/   32) PIO Privilege Lock Status Register (p_iogroup = 0) */
  __O   uint32_t                       PIO_P_SODR;         /**< Offset: 0x10 ( /W  32) PIO Privilege Set Output Data Register (p_iogroup = 0) */
  __O   uint32_t                       PIO_P_CODR;         /**< Offset: 0x14 ( /W  32) PIO Privilege Clear Output Data Register (p_iogroup = 0) */
  __IO  uint32_t                       PIO_P_ODSR;         /**< Offset: 0x18 (R/W  32) PIO Privilege Output Data Status Register (p_iogroup = 0) */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       PIO_P_IER;          /**< Offset: 0x20 ( /W  32) PIO Privilege Interrupt Enable Register (p_iogroup = 0) */
  __O   uint32_t                       PIO_P_IDR;          /**< Offset: 0x24 ( /W  32) PIO Privilege Interrupt Disable Register (p_iogroup = 0) */
  __I   uint32_t                       PIO_P_IMR;          /**< Offset: 0x28 (R/   32) PIO Privilege Interrupt Mask Register (p_iogroup = 0) */
  __I   uint32_t                       PIO_P_ISR;          /**< Offset: 0x2C (R/   32) PIO Privilege Interrupt Status Register (p_iogroup = 0) */
  __O   uint32_t                       PIO_P_SIO_UAR;      /**< Offset: 0x30 ( /W  32) PIO Privilege Set I/O User Register (p_iogroup = 0) */
  __O   uint32_t                       PIO_P_SIO_PAR;      /**< Offset: 0x34 ( /W  32) PIO Privilege Set I/O Privilege Register (p_iogroup = 0) */
  __I   uint32_t                       PIO_P_IOSSR;        /**< Offset: 0x38 (R/   32) PIO Privilege I/O Security Status Register (p_iogroup = 0) */
  __O   uint32_t                       PIO_P_IOFR;         /**< Offset: 0x3C ( /W  32) PIO Privilege I/O Freeze Configuration Register (p_iogroup = 0) */
} pio_p_registers_t;

#define PIO_GROUP_NUMBER 3

#define PIO_P_NUMBER 3

/** \brief PIO register API structure */
typedef struct
{
        pio_group_registers_t          PIO_GROUP[PIO_GROUP_NUMBER]; /**< Offset: 0x00  */
  __I   uint8_t                        Reserved1[0x520];
  __IO  uint32_t                       PIO_WPMR;           /**< Offset: 0x5E0 (R/W  32) PIO Write Protection Mode Register */
  __I   uint32_t                       PIO_WPSR;           /**< Offset: 0x5E4 (R/   32) PIO Write Protection Status Register */
  __I   uint8_t                        Reserved2[0xA18];
        pio_p_registers_t              PIO_P[PIO_P_NUMBER]; /**< Offset: 0x1000  */
  __I   uint8_t                        Reserved3[0x440];
  __IO  uint32_t                       PIO_P_SCDR;         /**< Offset: 0x1500 (R/W  32) PIO Privilege Slow Clock Divider Debouncing Register */
  __I   uint8_t                        Reserved4[0xDC];
  __IO  uint32_t                       PIO_P_WPMR;         /**< Offset: 0x15E0 (R/W  32) PIO Privilege Write Protection Mode Register */
  __I   uint32_t                       PIO_P_WPSR;         /**< Offset: 0x15E4 (R/   32) PIO Privilege Write Protection Status Register */
} pio_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTG_PIO_COMPONENT_H_ */
